import { makeQuestion, makeSurvey } from "./Survey";
//import list/map from wrapper

export const questionsJ = [
  makeQuestion(
    "A1.1 災害リスク管理のためのガバナンスメカニズムは、公衆衛生上の考慮事項をどの程度まで統合しているか？",
    "Placeholder Justification.",
    [
      "5 –公衆衛生のあらゆる機能（右参照）が、市の災害対策ガバナンスメカニズムおよびミーティングに日常的に情報を提供し、すべての主要な災害対策プログラムや文書に日常的に貢献している (参加は、多くの分野からの情報を組み合わせて指名された中心人物を通じて行われることもある)",
      "4 –ほとんどの公衆衛生機能の代表者は、通常、主要都市の災害レジリエンス会議に出席し、主要なプログラムに貢献しているが、関連するすべての活動に関与しているわけではない。",
      "3 –公衆衛生の機能は、独自の災害回復のためのフォーラムやメカニズムを持っているが、あらゆる機能が含まれているにもかかわらず、市政府、物流業者、コミュニティグループなどの他の当事者との調整が十分に行われていない。また、長期的な影響など、より広範なレジリエンスの問題ではなく、緊急事態への対応に焦点が絞られている場合もある。",
      "2 –一部の公衆衛生分野は、都市の防災活動に関与しているが、完全に関与しているわけではない。 ",
      "1 –都市の防災活動に公衆衛生分野が関与するのは初歩的なことに過ぎない。",
      "0 –この地域には公衆衛生の機能がないか、あっても災害レジリエンスにはまったく関与していない。",
    ]
  ),
  makeQuestion(
    "A2.1 疾病の発生を含む緊急事態や災害は、災害リスク計画にどの程度含まれているか？",
    "Placeholder Justification",
    [
      "5 –疾病の発生を含む緊急事態や災害は、それ自体がリスクシナリオとして、あるいは「複合」シナリオの構成要素として、市に完全に組み込まれている。スタッフの確保や医療施設への影響は、単独でも、流行病やパンデミックが対応の妨げになる可能性のある他のリスクと組み合わせても、モデル化され、計画されている。",
      "4 –疾病の発生を含む緊急事態や災害については、上記のように対応しているが、他のリスクと切り離して考える傾向があり、他のリスクとの相互作用が十分に考慮されていない可能性がある。",
      "3 –疾病の発生を含む緊急事態や災害は、想定される影響とともに考慮されているが、これらの影響は完全にはモデル化されていない。",
      "2 –疾病の発生を含む緊急事態や災害も考慮されるが、高いレベルにとどまる。",
      "1 –疾病の発生のリスクが問題として指摘されても、その影響や必要な対応策が積極的に検討されないことがある。",
      "0 –パンデミックを全く考慮していない",
    ]
  ),
];

export const whoSurveyJ = makeSurvey(questionsJ);
